
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一节 数据结构的基本概念和术语 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    第一章 绪论
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一节 数据结构的基本概念和术语
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二节 算法和算法评价
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    第二章 线性表
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../part2/1.html">
            
                <a href="../part2/1.html">
            
                    
                    第一节 线性表的定义和基本操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../part2/2.html">
            
                <a href="../part2/2.html">
            
                    
                    第二节 线性表的数据表示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../part2/3.html">
            
                <a href="../part2/3.html">
            
                    
                    第三节 线性表的链式表示
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../part2/4.html">
            
                <a href="../part2/4.html">
            
                    
                    第四节 顺序表和链表的比较
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    第三章 栈和队列
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../part3/1.html">
            
                <a href="../part3/1.html">
            
                    
                    第一节 栈的基本概念和栈的基本操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../part3/2.html">
            
                <a href="../part3/2.html">
            
                    
                    第二节 栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../part3/3.html">
            
                <a href="../part3/3.html">
            
                    
                    第三节 队列
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    第四章 串
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../part4/1.html">
            
                <a href="../part4/1.html">
            
                    
                    第一节 串的定义和基本操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../part4/2.html">
            
                <a href="../part4/2.html">
            
                    
                    第二节 串的存储结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../part4/3.html">
            
                <a href="../part4/3.html">
            
                    
                    第三节 串的模式匹配
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    第五章 树和二叉树
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../part5/1.html">
            
                <a href="../part5/1.html">
            
                    
                    第一节 串的定义和基本操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="../part5/2.html">
            
                <a href="../part5/2.html">
            
                    
                    第二节 二叉树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="../part5/3.html">
            
                <a href="../part5/3.html">
            
                    
                    第三节 二叉树的遍历
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="../part5/4.html">
            
                <a href="../part5/4.html">
            
                    
                    第四节 线索二叉树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.5" data-path="../part5/5.html">
            
                <a href="../part5/5.html">
            
                    
                    第五节 树和森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.6" data-path="../part5/6.html">
            
                <a href="../part5/6.html">
            
                    
                    第六节 树与二叉树应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    第六章 图
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="../part6/1.html">
            
                <a href="../part6/1.html">
            
                    
                    第一节 图的基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="../part6/2.html">
            
                <a href="../part6/2.html">
            
                    
                    第二节 图的存储及基本操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="../part6/3.html">
            
                <a href="../part6/3.html">
            
                    
                    第三节 图的遍历
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="../part6/4.html">
            
                <a href="../part6/4.html">
            
                    
                    第四节 图的应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    第七章 排序和查找
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="../part7/1.html">
            
                <a href="../part7/1.html">
            
                    
                    第一节 排序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" data-path="../part7/2.html">
            
                <a href="../part7/2.html">
            
                    
                    第二节 查找
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第一节 数据结构的基本概念和术语</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E00;&#x3001;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;">&#x4E00;&#x3001;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;</h1>
<h2 id="11-&#x6570;&#x636E;">1.1 &#x6570;&#x636E;</h2>
<p>&#x200B;        &#x6570;&#x636E;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x662F;&#x63CF;&#x8FF0;&#x5BA2;&#x89C2;&#x4E8B;&#x7269;&#x5C5E;&#x6027;&#x7684;&#x6570;&#x3001;&#x5B57;&#x7B26;&#x53CA;&#x6240;&#x6709;&#x80FD;&#x8F93;&#x5165;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x5E76;&#x88AB;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BC6;&#x522B;&#x548C;&#x5904;&#x7406;&#x7684;&#x7B26;&#x53F7;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6570;&#x636E;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x52A0;&#x5DE5;&#x7684;&#x539F;&#x6599;</p>
<h2 id="12-&#x6570;&#x636E;&#x5143;&#x7D20;">1.2 &#x6570;&#x636E;&#x5143;&#x7D20;</h2>
<p>&#x200B;        &#x6570;&#x636E;&#x5143;&#x7D20;&#x662F;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x901A;&#x5E38;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x8FDB;&#x884C;&#x8003;&#x8651;&#x548C;&#x5904;&#x7406;&#x3002;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x53EF;&#x7531;&#x82E5;&#x5E72;&#x6570;&#x636E;&#x9879;&#x7EC4;&#x6210;&#xFF0C;&#x6570;&#x636E;&#x9879;&#x662F;&#x6784;&#x6210;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;</p>
<h2 id="13-&#x6570;&#x636E;&#x5BF9;&#x8C61;">1.3 &#x6570;&#x636E;&#x5BF9;&#x8C61;</h2>
<p>&#x200B;        &#x6570;&#x636E;&#x5BF9;&#x8C61;&#x662F;&#x5177;&#x6709;&#x76F8;&#x540C;&#x6027;&#x8D28;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x3002;</p>
<h2 id="14-&#x6570;&#x636E;&#x7ED3;&#x6784;">1.4 &#x6570;&#x636E;&#x7ED3;&#x6784;</h2>
<p>&#x200B;        &#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x7279;&#x5B9A;&#x5173;&#x7CFB;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x96C6;&#x5408;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;&#x5B64;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x67D0;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x5143;&#x7D20;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x79F0;&#x4E3A;&#x7ED3;&#x6784;&#x3002;</p>
<h3 id="141-&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;">1.4.1 &#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;</h3>
<p>&#x6839;&#x636E;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x4E0D;&#x540C;&#x7279;&#x6027;&#x3002;&#x901A;&#x5E38;&#x6709;&#x4E0B;&#x5217;4&#x7C7B;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</p>
<ul>
<li>&#x96C6;&#x5408;&#xFF1A;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x9664;&#x4E86;&#x201C;&#x540C;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x201D;&#x7684;&#x5173;&#x7CFB;&#x5916;&#xFF0C;&#x522B;&#x65E0;&#x5176;&#x4ED6;&#x5173;&#x7CFB;</li>
<li>&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#xFF1A;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53EA;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x4E00;&#x4E2A;&#x7684;&#x5173;&#x7CFB;</li>
<li>&#x6811;&#x5F62;&#x7ED3;&#x6784;&#xFF1A;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x591A;&#x4E2A;&#x7684;&#x5173;&#x7CFB;</li>
<li>&#x7F51;&#x72B6;&#x7ED3;&#x6784;(&#x56FE;&#x72B6;&#x7ED3;&#x6784;)&#xFF1A;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5BF9;&#x591A;&#x4E2A;&#x7684;&#x5173;&#x7CFB;</li>
</ul>
<p>&#x200B;        &#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EA;&#x63CF;&#x8FF0;&#x4E86;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x3002;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x4E0E;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x65E0;&#x5173;&#xFF0C;&#x662F;&#x72EC;&#x7ACB;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x3002;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x5206;&#x4E3A;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#x548C;&#x975E;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#xFF0C;&#x7EBF;&#x6027;&#x8868;&#x662F;&#x5178;&#x578B;&#x7684;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#xFF0C;&#x6808;&#x548C;&#x961F;&#x5217;&#x3001;&#x4E32;&#x3001;&#x6570;&#x7EC4;&#x4E5F;&#x540C;&#x5C5E;&#x4E8E;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#x3002;&#x96C6;&#x5408;&#x3001;&#x6811;&#x548C;&#x56FE;&#x662F;&#x5178;&#x578B;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#x3002;</p>
<h3 id="142-&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;">1.4.2 &#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;</h3>
<p>&#x200B;        &#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x662F;&#x6307;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x8868;&#x793A;(&#x6620;&#x50CF;)&#xFF0C;&#x4E5F;&#x79F0;&#x7269;&#x7406;&#x7ED3;&#x6784;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x8868;&#x793A;&#x548C;&#x5173;&#x7CFB;&#x7684;&#x8868;&#x793A;&#x3002;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x662F;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x4F9D;&#x8D56;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x8BED;&#x8A00;&#x3002;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x4E3B;&#x8981;&#x6709;&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x3001;&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x3001;&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#x548C;&#x6563;&#x5217;&#x5B58;&#x50A8;&#x3002;</p>
<ul>
<li>&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#xFF1A;&#x628A;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5728;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x4E5F;&#x76F8;&#x90BB;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x7531;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x7684;&#x90BB;&#x63A5;&#x5173;&#x7CFB;&#x6765;&#x4F53;&#x73B0;&#x3002;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x968F;&#x673A;&#x5B58;&#x53D6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5360;&#x7528;&#x6700;&#x5C11;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF1B;&#x7F3A;&#x70B9;&#x662F;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x76F8;&#x90BB;&#x4E00;&#x6574;&#x5757;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x8F83;&#x591A;&#x7684;&#x5916;&#x90E8;&#x788E;&#x7247;&#x3002;</li>
<li>&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#xFF1A;&#x4E0D;&#x8981;&#x6C42;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x5728;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x4E0A;&#x4E5F;&#x76F8;&#x90BB;&#xFF0C;&#x501F;&#x52A9;&#x6307;&#x793A;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5730;&#x5740;&#x7684;&#x6307;&#x9488;&#x6765;&#x8868;&#x793A;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x3002;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x788E;&#x7247;&#x73B0;&#x8C61;&#xFF0C;&#x80FD;&#x5145;&#x5206;&#x5229;&#x7528;&#x6240;&#x6709;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF1B;&#x7F3A;&#x70B9;&#x662F;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x9634;&#x5B58;&#x50A8;&#x6307;&#x9488;&#x800C;&#x5360;&#x7528;&#x989D;&#x5916;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4E14;&#x53EA;&#x80FD;&#x5B9E;&#x73B0;&#x987A;&#x5E8F;&#x5B58;&#x53D6;</li>
<li>&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#xFF1A;&#x5728;&#x5B58;&#x50A8;&#x5143;&#x7D20;&#x4FE1;&#x606F;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x5EFA;&#x7ACB;&#x9644;&#x52A0;&#x7684;&#x7D22;&#x5F15;&#x8868;&#x3002;&#x7D22;&#x5F15;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x9879;&#x79F0;&#x4E3A;&#x7D22;&#x5F15;&#x9879;&#xFF0C;&#x7D22;&#x5F15;&#x9879;&#x7684;&#x4E00;&#x822C;&#x5F62;&#x5F0F;&#x662F;(&#x5173;&#x952E;&#x5B57;,&#x5730;&#x5740;)&#x3002;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x68C0;&#x7D22;&#x901F;&#x5EA6;&#x5FEB;&#xFF1B;&#x7F3A;&#x70B9;&#x662F;&#x9644;&#x52A0;&#x7684;&#x7D22;&#x5F15;&#x8868;&#x989D;&#x5916;&#x5360;&#x7528;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x589E;&#x52A0;&#x548C;&#x5220;&#x9664;&#x6570;&#x636E;&#x65F6;&#x4E5F;&#x8981;&#x4FEE;&#x6539;&#x7D22;&#x5F15;&#x8868;&#xFF0C;&#x56E0;&#x800C;&#x4F1A;&#x82B1;&#x8D39;&#x8F83;&#x591A;&#x7684;&#x65F6;&#x95F4;</li>
<li>&#x6563;&#x5217;&#x5B58;&#x50A8;&#xFF1A;&#x6839;&#x636E;&#x5143;&#x7D20;&#x7684;&#x5173;&#x952E;&#x5B57;&#x76F4;&#x63A5;&#x8BA1;&#x7B97;&#x51FA;&#x8BE5;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x50A8;&#x5730;&#x5740;&#xFF0C;&#x53C8;&#x79F0;&#x54C8;&#x5E0C;&#x5B58;&#x50A8;&#x3002;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x68C0;&#x7D22;&#x3001;&#x589E;&#x52A0;&#x548C;&#x5220;&#x9664;&#x7ED3;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x5F88;&#x5FEB;&#xFF1B;&#x7F3A;&#x70B9;&#x662F;&#x82E5;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E0D;&#x597D;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x7684;&#x51B2;&#x7A81;&#xFF0C;&#x800C;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x4F1A;&#x589E;&#x52A0;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x5F00;&#x9500;</li>
</ul>
<h3 id="143-&#x6570;&#x636E;&#x7684;&#x8FD0;&#x7B97;">1.4.3 &#x6570;&#x636E;&#x7684;&#x8FD0;&#x7B97;</h3>
<p>&#x200B;        &#x65BD;&#x52A0;&#x5728;&#x6570;&#x636E;&#x4E0A;&#x7684;&#x8FD0;&#x7B97;&#x5305;&#x62EC;&#x8FD0;&#x7B97;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x5B9E;&#x73B0;&#x3001;&#x8FD0;&#x7B97;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x9488;&#x5BF9;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x7684;&#x3002;&#x6307;&#x51FA;&#x8FD0;&#x7B97;&#x7684;&#x529F;&#x80FD;&#xFF1B;&#x8FD0;&#x7B97;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x9488;&#x5BF9;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x7684;&#xFF0C;&#x6307;&#x51FA;&#x8FD0;&#x7B97;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x200B;        &#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x548C;&#x6570;&#x636E;&#x7684;&#x8FD0;&#x7B97;&#x7EDF;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x4E09;&#x8981;&#x7D20;</p>
<h2 id="15-&#x6570;&#x636E;&#x7C7B;&#x578B;">1.5 &#x6570;&#x636E;&#x7C7B;&#x578B;</h2>
<p>&#x200B;        &#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x96C6;&#x5408;&#x548C;&#x5B9A;&#x4E49;&#x5728;&#x6B64;&#x96C6;&#x5408;&#x4E0A;&#x7684;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#x7684;&#x603B;&#x79F0;&#x3002;&#x5176;&#x5206;&#x4E3A;</p>
<ul>
<li>&#x539F;&#x5B50;&#x7C7B;&#x578B;&#xFF1A;&#x5176;&#x503C;&#x4E0D;&#x53EF;&#x518D;&#x5206;&#x7684;&#x7C7B;&#x578B;</li>
<li>&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#xFF1A;&#x5176;&#x503C;&#x53EF;&#x4EE5;&#x518D;&#x5206;&#x89E3;&#x4E3A;&#x82E5;&#x5E72;&#x6210;&#x5206;(&#x5206;&#x91CF;)&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;</li>
<li>&#x62BD;&#x8C61;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x62BD;&#x8C61;&#x6570;&#x636E;&#x7EC4;&#x7EC7;&#x4EE5;&#x53CA;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="2.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 第二节 算法和算法评价">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一节 数据结构的基本概念和术语","level":"1.2.1","depth":2,"next":{"title":"第二节 算法和算法评价","level":"1.2.2","depth":2,"path":"part1/2.md","ref":"part1/2.md","articles":[]},"previous":{"title":"第一章 绪论","level":"1.2","depth":1,"ref":"","articles":[{"title":"第一节 数据结构的基本概念和术语","level":"1.2.1","depth":2,"path":"part1/1.md","ref":"part1/1.md","articles":[]},{"title":"第二节 算法和算法评价","level":"1.2.2","depth":2,"path":"part1/2.md","ref":"part1/2.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex","livereload"],"pluginsConfig":{"katex":{},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part1/1.md","mtime":"2022-03-30T15:18:29.557Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-31T05:55:51.946Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

